# Terminal
cask "ghostty"

# Editor
cask "zed"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Shell Plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# CLI Tools
brew "fzf"
brew "zoxide"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "eza"
brew "bat"
brew "jq"
brew "yq"
brew "delta"
brew "atuin"
brew "starship"

# Runtime Version Manager
brew "asdf"
